InformationRegisters/СоответствиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодставляемаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ЛексВызовСервера/Ext/Module.bsl
Функция ПолучитьСтруктуруПодставляемойНоменклатурыПоЦветуЛДСП(Номенклатура, Подразделение) Экспорт
	
	Возврат РегистрыСведений.СоответствиеНоменклатуры.ПолучитьСтруктуруСоответствий(Номенклатура, Подразделение);
	
КонецФункции // ПолучитьСтруктуруПодставляемойНоменклатурыПоЦветуЛДСП()

Функция ПолучитьСтруктуруПодставляемойНоменклатурыПоЦветуПоГруппе(Номенклатура, НоменклатурнаяГруппа, Подразделение) Экспорт
	
	Возврат РегистрыСведений.СоответствиеНоменклатуры.ПолучитьСоответствие(Номенклатура, НоменклатурнаяГруппа, Подразделение);
	
КонецФункции // ПолучитьСтруктуруПодставляемойНоменклатурыПоЦветуПоГруппе()
